       ID DIVISION.
       PROGRAM-ID. COB401.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
              SELECT RPFL ASSIGN TO BRD4RP
              ORGANIZATION IS SEQUENTIAL
              ACCESS IS SEQUENTIAL
              FILE STATUS IS FS-RPFL.
       DATA DIVISION.
       FILE SECTION.
       FD RPFL.
       01 RPFL-REC                         PIC X(320).
       WORKING-STORAGE SECTION.
       01 WS-U                             PIC 9(02) EXTERNAL.
       01 WS-X                             PIC 9(02) EXTERNAL.
       01 WS-Y                             PIC 9(02).
       01 WS-I                             PIC 9(02) EXTERNAL.
       01 WS-AR-TABLE EXTERNAL.
          02 WS-ARRAY-LOAN-DATA OCCURS 40 TIMES.
           05 WS-AR-COL1                     PIC 9(10).
           05 WS-AR-COL2                     PIC 9(02).
           05 WS-AR-COL3                     PIC X(10).
           05 WS-AR-COL4                     PIC X(10).
       01 WS-TABLE2 EXTERNAL.
          02 WS-ARRAY-CURBAL OCCURS 50 TIMES.
             05 WS-ARR-APPID1                   PIC 9(10).
             05 WS-ARR-BALAMT1                  PIC 9(10).
       01 WS-TABLE EXTERNAL.
          02 WS-ARRAY-LOAN OCCURS 50 TIMES.
             05 WS-ARR-APDD                     PIC 9(10).
             05 WS-ARR-APPID                    PIC 9(10).
             05 WS-ARR-NEXTRPAYDD               PIC 9(10).
             05 WS-ARR-MONRAMT                  PIC 9(10).
             05 WS-ARR-CURBALAMT                PIC 9(10).
       01 WS-TEMP-APDATE.
          05 WS-TEMP-YEAR                  PIC 9(04).
          05 WS-TEMP-MONTH                 PIC 9(02).
          05 WS-TEMP-DAY                   PIC 9(02).
       01 WS-TEMP-RPAYDD.
          05 WS-TEMP-YEAR1                 PIC 9(04).
          05 WS-TEMP-MONTH1                PIC 9(02).
          05 WS-TEMP-DAY1                  PIC 9(02).
       01 WS-MOVE-APDATE                   PIC 9(08).
       01 WS-MOVE-RPAYDD                   PIC 9(08).
       01 WS-AMP-DAYS                      PIC 9(03).
       01 WS-RPAY-DAYS                     PIC 9(03).
       01 WS-DAYS-DIFFERENCE               PIC 9(03).
       01 FILE-STATUS                      PIC X(02).
       01 WS-TEMP-APPID                    PIC 9(10).
       01 WS-TEMP-LOANID                   PIC 9(02).
       01 WS-TEMP-MONRAMT                  PIC 9(10).
       01 WS-TEMP-BALAMT                   PIC 9(10).
       01 WS-DELIMIT-SPACES           PIC X(02) VALUE ALL SPACES.
       01 FS-RPFL                          PIC X(02).
           EXEC SQL INCLUDE SQLCA END-EXEC.
           EXEC SQL INCLUDE APPLC END-EXEC.
           EXEC SQL INCLUDE LOAN END-EXEC.
           EXEC SQL INCLUDE PAYMENT END-EXEC.
           EXEC SQL
               DECLARE EMPCUR CURSOR FOR SELECT
               APPID, LOANID, LTYPE, NEXTRPAYDD, MONRAMT, BALAMT
               FROM TECN033.LOAN
           END-EXEC.
           EXEC SQL
               DECLARE PAYCUR CURSOR FOR SELECT
               APPID, LOANID, CURBALAMT, APDATE
               FROM TECN033.PAYMENT
           END-EXEC.
       PROCEDURE DIVISION.
       0000-MAIN-PARA.
           PERFORM 1000-INITIALIZE-PARA THRU
           1000-INITIALIZE-PARA
           PERFORM 2000-OPEN-PARA THRU
           2000-OPEN-PARA-EXIT
           PERFORM 3000-PROCESS-PARA THRU
           3000-PROCESS-PARA-EXIT
           PERFORM 4000-CLOSE-PARA THRU
           4000-CLOSE-PARA-EXIT
           PERFORM 5000-SUBPROGRAM-PARA THRU
           5000-SUBPROGRAM-PARA-EXIT
           PERFORM 3200-MOVE-REPORT-PARA THRU
           3200-MOVE-REPORT-PARA-EXIT
           PERFORM 6000-CALL-REPORT-PARA THRU
           6000-CALL-REPORT-PARA-EXIT
           PERFORM 9000-TERM-PARA THRU
           9000-TERM-PARA-EXIT.
       0000-MAIN-PARA-EXIT.
           EXIT
           .
       1000-INITIALIZE-PARA.
           INITIALIZE FILE-STATUS.
       1000-INITIALIZE-PARA-EXIT.
           EXIT
           .
       2000-OPEN-PARA.
           OPEN OUTPUT RPFL.
           DISPLAY 'OPEN CSV FILE ' FS-RPFL.
           DISPLAY 'I AM IN OPEN PARA'.
           EXEC SQL
               OPEN EMPCUR
           END-EXEC.
           EXEC SQL
               OPEN PAYCUR
           END-EXEC.
       2000-OPEN-PARA-EXIT.
           EXIT.
       3000-PROCESS-PARA.
           DISPLAY 'I AM IN PROCESS PARA'
           PERFORM UNTIL SQLCODE = 100
           EXEC SQL
               FETCH EMPCUR INTO
               :VH-APPID, :VH-LOANID, :VH-LTYPE,
               :VH-NEXTRPAYDD, :VH-MONRAMT, :VH-BALAMT
           END-EXEC
           MOVE VH-APPID TO SV-APPID
           EXEC SQL
               SELECT APDATE, CURBALAMT INTO :SV-APDATE, :SV-CURBALAMT
               FROM PAYMENT
               WHERE APPID = :SV-APPID
           END-EXEC
           PERFORM 3100-COMP-PARA THRU 3100-COMP-PARA-EXIT
           END-PERFORM.
       3000-PROCESS-PARA-EXIT.
           EXIT.
       3100-COMP-PARA.
      *    DISPLAY VH-LOANID ' LOANID '.
           DISPLAY 'INSIDE COMP-PARA'.
      *    DISPLAY 'AMOUNT PAID' SV-APDATE.
      *    DISPLAY 'NEXT REPAYMENT DATE' VH-NEXTRPAYDD.
      *    DISPLAY SV-APDATE(1:2) ' DAY '.
           MOVE SV-APDATE(1:2) TO WS-TEMP-DAY.
           MOVE SV-APDATE(4:2) TO WS-TEMP-MONTH.
           MOVE SV-APDATE(7:4) TO WS-TEMP-YEAR.
      *    DISPLAY WS-TEMP-APDATE ' AMP DATE '.
           MOVE VH-NEXTRPAYDD(1:2) TO WS-TEMP-DAY1.
           MOVE VH-NEXTRPAYDD(4:2) TO WS-TEMP-MONTH1.
           MOVE VH-NEXTRPAYDD(7:4) TO WS-TEMP-YEAR1.
      *    DISPLAY WS-TEMP-RPAYDD ' RAPY DATE '.
           MOVE WS-TEMP-RPAYDD TO WS-MOVE-RPAYDD.
           MOVE WS-TEMP-APDATE TO WS-MOVE-APDATE.
      *    DISPLAY WS-MOVE-RPAYDD ' MOVE RPAYDD '.
      *    DISPLAY WS-MOVE-APDATE ' MOVE APDATE '.
           COMPUTE WS-AMP-DAYS =
                   FUNCTION INTEGER-OF-DATE(WS-MOVE-APDATE).
           COMPUTE WS-RPAY-DAYS =
                   FUNCTION INTEGER-OF-DATE(WS-MOVE-RPAYDD).
      *    DISPLAY WS-AMP-DAYS ' AMP DAY '.
      *    DISPLAY WS-RPAY-DAYS ' RPAY DAYS '.
           COMPUTE WS-DAYS-DIFFERENCE = WS-RPAY-DAYS - WS-AMP-DAYS.
      *    DISPLAY WS-DAYS-DIFFERENCE ' DIFFERENCE '.
           PERFORM 3200-CHECK-PARA THRU 3200-CHECK-PARA-EXIT.
       3100-COMP-PARA-EXIT.
           EXIT.
       3200-CHECK-PARA.
           EVALUATE TRUE
              WHEN WS-DAYS-DIFFERENCE >= 30
      *          DISPLAY 'LESS THEN 30'
                 PERFORM 3300-MOVE-TO-REPORT-PARA THRU
                         3300-MOVE-TO-REPORT-PARA-EXIT
              WHEN OTHER
      *          DISPLAY 'GREATER THEN 30'
                 CONTINUE
           END-EVALUATE.
       3200-CHECK-PARA-EXIT.
           EXIT.
       3300-MOVE-TO-REPORT-PARA.
      *    DISPLAY 'IN MOVE TO REPORT PARA'.
           MOVE VH-APPID TO WS-TEMP-APPID.
           MOVE VH-LOANID TO WS-TEMP-LOANID.
           MOVE VH-BALAMT TO WS-TEMP-BALAMT.
           MOVE VH-MONRAMT TO WS-TEMP-MONRAMT.
           MOVE SPACES TO RPFL-REC.
           STRING '10' DELIMITED BY SIZE
                  ',' DELIMITED BY SIZE
                  WS-TEMP-APPID DELIMITED BY SIZE
                  ',' DELIMITED BY SIZE
                  WS-TEMP-LOANID DELIMITED BY SIZE
                  ',' DELIMITED BY SIZE
                  VH-LTYPE DELIMITED BY WS-DELIMIT-SPACES
                  ',' DELIMITED BY SIZE
                  VH-NEXTRPAYDD DELIMITED BY SIZE
                  ',' DELIMITED BY SIZE
                  WS-TEMP-MONRAMT DELIMITED BY SIZE
                  ',' DELIMITED BY SIZE
                  WS-TEMP-BALAMT DELIMITED BY SIZE
                  INTO RPFL-REC
            END-STRING.
            WRITE RPFL-REC.
            DISPLAY 'I AM A PARA'.
            PERFORM 3400-MOVE-TO-ARRAY-PARA THRU
            3400-MOVE-TO-ARRAY-PARA-EXIT.
       3300-MOVE-TO-REPORT-PARA-EXIT.
            EXIT.
       3400-MOVE-TO-ARRAY-PARA.
            ADD 1 TO WS-U.
            MOVE VH-APPID TO WS-ARR-APPID(WS-U).
            MOVE WS-RPAY-DAYS TO WS-ARR-NEXTRPAYDD(WS-U).
            MOVE VH-MONRAMT TO WS-ARR-MONRAMT(WS-U).
            MOVE WS-AMP-DAYS TO WS-ARR-APDD(WS-U).
            MOVE SV-CURBALAMT TO WS-ARR-CURBALAMT(WS-U).
            DISPLAY WS-ARRAY-LOAN(WS-U).
            DISPLAY WS-U.
       3400-MOVE-TO-ARRAY-PARA-EXIT.
            EXIT.
       4000-CLOSE-PARA.
           CLOSE RPFL.
           DISPLAY 'I AM IN CLOSE PARA'
           EXEC SQL
               CLOSE EMPCUR
           END-EXEC.
       4000-CLOSE-PARA-EXIT.
           EXIT.
       5000-SUBPROGRAM-PARA.
           DISPLAY 'INSIDE SUBPROGRAM PARA'.
           CALL 'COB402'.
           PERFORM 5100-UPDATE-DB2-PARA THRU
                   5100-UPDATE-DB2-PARA-EXIT.
       5000-SUBPROGRAM-PARA-EXIT.
           EXIT.
       5100-UPDATE-DB2-PARA.
           DISPLAY 'INSIDE DATABASE UPDATE PARA'.
           DISPLAY WS-X.
           PERFORM UNTIL WS-Y > ( WS-X - 1 )
              ADD 1 TO WS-Y
              DISPLAY 'VALUE ' WS-ARRAY-CURBAL(WS-Y)
              MOVE WS-ARR-APPID1(WS-Y) TO SV-APPID VH-APPID
              MOVE WS-ARR-BALAMT1(WS-Y) TO SV-CURBALAMT VH-BALAMT
      *---------------UNCOMMENT--------------------------
      *       EXEC SQL
      *          UPDATE PAYMENT SET CURBALAMT = :SV-CURBALAMT
      *          WHERE APPID = :SV-APPID
      *       END-EXEC
      *       EXEC SQL
      *          UPDATE LOAN SET BALAMT = :VH-BALAMT
      *          WHERE APPID = :VH-APPID
      *       END-EXEC
           END-PERFORM.
       5100-UPDATE-DB2-PARA-EXIT.
           EXIT.
       3200-MOVE-REPORT-PARA.
           MOVE 00 TO SQLCODE.
           PERFORM UNTIL SQLCODE = 100
           EXEC SQL
               FETCH PAYCUR INTO
               :SV-APPID, :SV-LOANID, :SV-CURBALAMT, :SV-APDATE
           END-EXEC

           DISPLAY '-------------------INSIDE REPORT PARA--------'
           DISPLAY SV-CURBALAMT
           EVALUATE TRUE
              WHEN SV-CURBALAMT < 0000030000
                 ADD 1 TO WS-I
                 DISPLAY WS-I
                 MOVE SV-APPID TO WS-AR-COL1(WS-I)
                 MOVE SV-LOANID TO WS-AR-COL2(WS-I)
                 MOVE SV-APDATE TO WS-AR-COL3(WS-I)
                 MOVE SV-CURBALAMT TO WS-AR-COL4(WS-I)
                 DISPLAY WS-ARRAY-LOAN-DATA(WS-I)
              WHEN OTHER
                 CONTINUE
           END-EVALUATE
           END-PERFORM.
       3200-MOVE-REPORT-PARA-EXIT.
           EXIT.
       6000-CALL-REPORT-PARA.
           DISPLAY 'CALLING SUBPROGRAM FOR REPORT'.
           CALL 'REPSUB4'.
       6000-CALL-REPORT-PARA-EXIT.
           EXIT.
       9000-TERM-PARA.
           STOP RUN.
       9000-TERM-PARA-EXIT.
           EXIT
           .
