//TECN033J JOB NOTIFY=&SYSUID
//STEP001  EXEC PGM=SORT
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SORTIN   DD DSN=TECN033.CAR.BRD4.SORT.REPORT.PS,DISP=SHR
//SORTOUT  DD DSN=TECN033.CAR.BRD4.SORT.REPORT.PS,DISP=OLD
//SYSIN    DD *
//*SORT FIELDS=(100,9,CH,A,1,10,ZD,A,98,2,ZD,A)
/*
